reproducibilityPackages/idependencestudy/openfoam/gridIndependence/h0.002/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version  2.0;
  format   ascii;
  class    dictionary;
  location "system";
  object   controlDict;
}

//****************************************************************************//

application       icoFoam;
startFrom         startTime;
startTime         0.0;
stopAt            endTime;
endTime           80.0;
deltaT            0.002;
writeControl      runTime;
writeInterval     1.0;
purgeWrite        0;
writeFormat       ascii;
writePrecision    6;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable false;

functions
{
  forceCoeffs
  {
    type forceCoeffs;
    functionObjectLibs ("libforces.so");
    outputControl timeStep;
    outputInterval 1;
    patches
    (
      snake
    );
    pName p;
    UName U;
    rhoName rhoInf;
    log true;
    rhoInf 1.;
    CofR (0 0 0);
    liftDir (0 1 0);
    dragDir (1 0 0);
    pitchAxis (0 0 1);
    magUInf 1.0;
    lRef 1;
    Aref 1;
  }
  forces
  {
    type forces;
    functionObjectLibs ("libforces.so");
    outputControl timeStep;
    outputInterval 1;
    patches
    (
      snake
    );
    pName p;
    UName U;
    rhoName rhoInf;
    log true;
    rhoInf 1.;
    CofR (0 0 0);
    liftDir (0 1 0);
    dragDir (1 0 0);
    pitchAxis (0 0 1);
    magUInf 1.0;
    lRef 1;
    Aref 1;
  }
}

//****************************************************************************//
